; domain
(define (domain depot)
(:requirements :strips)
(:predicates
	 (facing_up ?x) (at ?x ?y) (on ?x ?y) (in ?x ?y) (lifting ?x ?y) (available ?x) (clear ?x)(place ?x) (locatable ?x) (depot ?x) (distributor ?x) (truck ?x) (hoist ?x) (surface ?x) (pallet ?x) (crate ?x) )
(:action drive
 :parameters ( ?x ?y ?z)
 :precondition
	(and (truck ?x) (place ?y) (place ?z)  (at ?x ?y))
 :effect
	(and (at ?x ?z) (not (at ?x ?y))))

(:action lift
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (surface ?z) (place ?p)  (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
 :effect
	(and (lifting ?x ?y) (clear ?z) (not (at ?y ?p)) (not (clear ?y)) (not (available ?x)) (not (on ?y ?z))))

(:action drop
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (facing_up ?y) (hoist ?x) (crate ?y) (surface ?z) (place ?p)  (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
 :effect
	(and (available ?x) (at ?y ?p) (clear ?y) (on ?y ?z) (not (lifting ?x ?y)) (not (clear ?z))))

(:action load
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (truck ?z) (place ?p)  (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
 :effect
	(and (in ?y ?z) (available ?x) (not (lifting ?x ?y))))

(:action lift_and_load
 :parameters ( ?x ?y ?z ?p ?q)
 :precondition
	(and (hoist ?x) (crate ?y) (surface ?z) (place ?p) (truck ?q) (at ?q ?p) (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
 :effect
	(and (in ?y ?q) (available ?x) (clear ?z) (not (at ?y ?p)) (not (clear ?y)) (not (on ?y ?z))))

(:action unload
 :parameters ( ?x ?y ?z ?p)
 :precondition
	(and (hoist ?x) (crate ?y) (truck ?z) (place ?p)  (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
 :effect
	(and (lifting ?x ?y) (not (in ?y ?z)) (not (available ?x))))

(:action turn_crate
 :parameters ( ?x ?y )
 :precondition
	(and (hoist ?x) (crate ?y) (lifting ?x ?y))
 :effect
	(facing_up ?y))

)

; problem
(define (problem depotprob5646) (:domain Depot)
(:objects
	depot0 depot1 depot2 distributor0 distributor1 distributor2 truck0 truck1 pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 crate0 crate1 crate2 crate3 crate4 crate5 hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 )
(:init
	(facing_up crate0)
	(facing_up crate1)
	(facing_up crate2)
	(facing_up crate3)
	(facing_up crate4)
	(facing_up crate5)
	(pallet pallet0)
	(surface pallet0)
	(at pallet0 depot0)
	(clear crate2)
	(pallet pallet1)
	(surface pallet1)
	(at pallet1 depot1)
	(clear pallet1)
	(pallet pallet2)
	(surface pallet2)
	(at pallet2 depot2)
	(clear crate5)
	(pallet pallet3)
	(surface pallet3)
	(at pallet3 distributor0)
	(clear crate4)
	(pallet pallet4)
	(surface pallet4)
	(at pallet4 distributor1)
	(clear pallet4)
	(pallet pallet5)
	(surface pallet5)
	(at pallet5 distributor2)
	(clear pallet5)
	(pallet pallet6)
	(surface pallet6)
	(at pallet6 distributor1)
	(clear pallet6)
	(pallet pallet7)
	(surface pallet7)
	(at pallet7 depot0)
	(clear pallet7)
	(pallet pallet8)
	(surface pallet8)
	(at pallet8 depot0)
	(clear crate3)
	(pallet pallet9)
	(surface pallet9)
	(at pallet9 distributor0)
	(clear pallet9)
	(truck truck0)
	(at truck0 distributor1)
	(truck truck1)
	(at truck1 depot0)
	(hoist hoist0)
	(at hoist0 depot0)
	(available hoist0)
	(hoist hoist1)
	(at hoist1 depot1)
	(available hoist1)
	(hoist hoist2)
	(at hoist2 depot2)
	(available hoist2)
	(hoist hoist3)
	(at hoist3 distributor0)
	(available hoist3)
	(hoist hoist4)
	(at hoist4 distributor1)
	(available hoist4)
	(hoist hoist5)
	(at hoist5 distributor2)
	(available hoist5)
	(crate crate0)
	(surface crate0)
	(at crate0 depot2)
	(on crate0 pallet2)
	(crate crate1)
	(surface crate1)
	(at crate1 depot2)
	(on crate1 crate0)
	(crate crate2)
	(surface crate2)
	(at crate2 depot0)
	(on crate2 pallet0)
	(crate crate3)
	(surface crate3)
	(at crate3 depot0)
	(on crate3 pallet8)
	(crate crate4)
	(surface crate4)
	(at crate4 distributor0)
	(on crate4 pallet3)
	(crate crate5)
	(surface crate5)
	(at crate5 depot2)
	(on crate5 crate1)
	(place depot0)
	(place depot1)
	(place depot2)
	(place distributor0)
	(place distributor1)
	(place distributor2)
)

(:goal (and
		(on crate0 pallet0)
		(on crate1 pallet5)
		(on crate2 pallet4)
		(on crate3 pallet7)
		(on crate4 pallet9)
		(on crate5 pallet1)
	)
))

; plan
1. (lift_and_load hoist0 crate2 pallet0 depot0 truck1)
   deleted: (at crate2 depot0) (clear crate2) (on crate2 pallet0)
   added: (in crate2 truck1) (clear pallet0)
   goals met: 0 of 6
2. (lift hoist3 crate4 pallet3 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 pallet3)
   added: (lifting hoist3 crate4) (clear pallet3)
   goals met: 0 of 6
3. (drop hoist3 crate4 pallet9 distributor0)
   deleted: (lifting hoist3 crate4) (clear pallet9)
   added: (available hoist3) (at crate4 distributor0) (clear crate4) (on crate4 pallet9)
   goals met: 1 of 6
4. (lift hoist0 crate3 pallet8 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet8)
   added: (lifting hoist0 crate3) (clear pallet8)
   goals met: 1 of 6
5. (drop hoist0 crate3 pallet7 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet7)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet7)
   goals met: 2 of 6
6. (drive truck1 depot0 depot2)
   deleted: (at truck1 depot0)
   added: (at truck1 depot2)
   goals met: 2 of 6
7. (lift_and_load hoist2 crate5 crate1 depot2 truck1)
   deleted: (at crate5 depot2) (clear crate5) (on crate5 crate1)
   added: (in crate5 truck1) (clear crate1)
   goals met: 2 of 6
8. (lift_and_load hoist2 crate1 crate0 depot2 truck1)
   deleted: (at crate1 depot2) (clear crate1) (on crate1 crate0)
   added: (in crate1 truck1) (clear crate0)
   goals met: 2 of 6
9. (lift_and_load hoist2 crate0 pallet2 depot2 truck1)
   deleted: (at crate0 depot2) (clear crate0) (on crate0 pallet2)
   added: (in crate0 truck1) (clear pallet2)
   goals met: 2 of 6
10. (drive truck1 depot2 depot1)
   deleted: (at truck1 depot2)
   added: (at truck1 depot1)
   goals met: 2 of 6
11. (unload hoist1 crate5 truck1 depot1)
   deleted: (in crate5 truck1) (available hoist1)
   added: (lifting hoist1 crate5)
   goals met: 2 of 6
12. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 2 of 6
13. (unload hoist5 crate1 truck1 distributor2)
   deleted: (in crate1 truck1) (available hoist5)
   added: (lifting hoist5 crate1)
   goals met: 2 of 6
14. (drop hoist1 crate5 pallet1 depot1)
   deleted: (lifting hoist1 crate5) (clear pallet1)
   added: (available hoist1) (at crate5 depot1) (clear crate5) (on crate5 pallet1)
   goals met: 3 of 6
15. (drop hoist5 crate1 pallet5 distributor2)
   deleted: (lifting hoist5 crate1) (clear pallet5)
   added: (available hoist5) (at crate1 distributor2) (clear crate1) (on crate1 pallet5)
   goals met: 4 of 6
16. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 4 of 6
17. (unload hoist0 crate0 truck1 depot0)
   deleted: (in crate0 truck1) (available hoist0)
   added: (lifting hoist0 crate0)
   goals met: 4 of 6
18. (drop hoist0 crate0 pallet0 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet0)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 pallet0)
   goals met: 5 of 6
19. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 5 of 6
20. (unload hoist4 crate2 truck1 distributor1)
   deleted: (in crate2 truck1) (available hoist4)
   added: (lifting hoist4 crate2)
   goals met: 5 of 6
21. (drop hoist4 crate2 pallet4 distributor1)
   deleted: (lifting hoist4 crate2) (clear pallet4)
   added: (available hoist4) (at crate2 distributor1) (clear crate2) (on crate2 pallet4)
   goals met: 6 of 6
